{
  "backend/main.mo": "Main canister logic providing product catalog, carts, orders, user profiles, logo and CEO photo storage, with admin-gated mutations and public queries.",
  "backend/migration.mo": "Migration module upgrading actor state by adding a new logo field while preserving existing stored data.",
  "feature_evidence.json": "Feature evidence report mapping features to affected files, components, and tests with confidence metadata.",
  "frontend-file-summaries.txt": "Pre-generated summaries of all frontend files describing their purpose and functionality.",
  "frontend/index.css": "Tailwind base styles and custom CSS variables defining light and dark theme color tokens.",
  "frontend/index.html": "Root HTML document mounting the React application and loading the entry script.",
  "frontend/src/App.tsx": "Sets up routing, theming, and global providers, defining all public and admin-protected routes.",
  "frontend/src/components/about/CeoPhotoUploadField.tsx": "Allows admins to upload and replace the CEO photo with progress tracking and error handling.",
  "frontend/src/components/admin/AdminProductTable.tsx": "Displays a searchable product table with edit and delete actions, including a deletion confirmation dialog.",
  "frontend/src/components/admin/ImageUploadField.tsx": "Handles product image selection, upload progress, preview, and removal, emitting updates via a callback.",
  "frontend/src/components/admin/LogoUploadCard.tsx": "Provides UI for admins to upload, preview, and replace the site logo with validation and progress tracking.",
  "frontend/src/components/admin/ProductForm.tsx": "Form component for creating or editing products, handling input state, image upload, and submission via admin product mutations.",
  "frontend/src/components/AppLayout.tsx": "Page layout wrapper providing header, footer, and animated main content area.",
  "frontend/src/components/Auth/AccessDeniedScreen.tsx": "Displays an access denied message with conditional text based on login state and navigation buttons.",
  "frontend/src/components/Auth/LoginButton.tsx": "Authentication button handling login/logout via Internet Identity and showing profile name when signed in.",
  "frontend/src/components/Auth/ProfileSetupModal.tsx": "Displays a modal prompting new authenticated users to enter their name and saves the profile via a mutation.",
  "frontend/src/components/Auth/ProtectedAdminRoute.tsx": "Checks authentication and admin role before rendering children, otherwise shows a loading spinner or access denied screen.",
  "frontend/src/components/cart/AddToCartButton.tsx": "Renders quantity input and button to add a product to the cart, enforcing auth and stock checks.",
  "frontend/src/components/cart/CartLineItem.tsx": "Displays a cart item with product info, quantity controls, total price, and actions to update or remove it.",
  "frontend/src/components/products/CategoryFilter.tsx": "Category tab selector that triggers filtering when a category is chosen.",
  "frontend/src/components/products/CategoryIconStrip.tsx": "Static image strip displaying tool-category icons for visual navigation.",
  "frontend/src/components/products/ProductCard.tsx": "Shows a product preview card with image, details, price, stock state, and link to product page.",
  "frontend/src/components/products/ProductImage.tsx": "Safely displays a product image or a fallback icon if no image is available.",
  "frontend/src/components/SiteFooter.tsx": "Renders the site footer with links, contact info, and a dynamic copyright message referencing caffeine.ai.",
  "frontend/src/components/SiteHeader.tsx": "Shows the site header with navigation, logo, cart indicator, login, and a mobile menu, adapting links based on admin status.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on authentication, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useAdminProducts.ts": "Provides mutations for creating, updating, and deleting products, invalidating product queries and showing toasts.",
  "frontend/src/hooks/useCart.ts": "Hooks for retrieving and mutating cart data, including adding, updating, removing items, clearing the cart, and computing totals.",
  "frontend/src/hooks/useCeoPhoto.ts": "Fetches and updates the CEO photo stored in the backend.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Fetches the current caller's user profile, handling actor-loading state.",
  "frontend/src/hooks/useCurrentUserRole.ts": "Fetches the current caller's user role from the backend.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, exposing identity state and login/logout helpers.",
  "frontend/src/hooks/useLogo.ts": "Defines React Query hooks to fetch and update a logo via the backend actor, with cache invalidation and toast notifications.",
  "frontend/src/hooks/useOrders.ts": "Implements hooks to place orders and fetch single, user, or all orders using the actor with identity-based enabling.",
  "frontend/src/hooks/useProducts.ts": "Contains hooks to fetch all products or a single product and a helper to extract sorted product categories.",
  "frontend/src/hooks/useQueries.ts": "Provides a mutation hook to save the caller’s user profile and invalidate its related query.",
  "frontend/src/index.css": "Tailwind CSS config defining theme variables, dark mode styles, animations, and interaction utility classes.",
  "frontend/src/lib/utils.ts": "Exports a utility function that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and the Internet Identity provider before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page showing CEO information, company values, and admin-only CEO photo upload.",
  "frontend/src/pages/AdminOrdersPage.tsx": "Displays all customer orders with loading states, order details, and user profile info.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page for managing products, creating/editing items, and updating the site logo.",
  "frontend/src/pages/CartPage.tsx": "Displays cart items, calculates totals, and provides navigation to catalog or checkout with loading and empty states.",
  "frontend/src/pages/CatalogPage.tsx": "Fetches products, supports category filtering, and renders a product grid with loading and empty states.",
  "frontend/src/pages/CheckoutPage.tsx": "Shows order items, calculates totals, places orders, and displays a confirmation screen after successful purchase.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero banner, feature highlights, and navigation to catalog or about pages.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Fetches and displays detailed product info with add-to-cart support and navigation back to the catalog.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Configures Tailwind with typography, container queries, custom colors, animations, fonts, and theme extensions for the frontend.",
  "project_state.json": "Defines the project's schema, state, features, architectural notes, and requirements for the FS Enterprises website."
}