{
  "backend/main.mo": "Motoko canister implementing products, cart, orders, user profiles, blob storage, and admin‑restricted updates with authentication checks.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind-based global stylesheet defining design tokens, light/dark variables, and base styles.",
  "frontend/index.html": "Root HTML file setting up the app container and loading the main React entry script.",
  "frontend/src/App.tsx": "Main React router and theme setup defining all routes, including protected admin pages and global providers.",
  "frontend/src/components/about/CeoPhotoUploadField.tsx": "Provides an admin-only file upload field for updating the CEO photo with progress tracking and error handling.",
  "frontend/src/components/admin/AdminProductTable.tsx": "Shows a searchable product table with edit and delete actions, including confirmation before deletion.",
  "frontend/src/components/admin/ImageUploadField.tsx": "Handles product image selection, preview, and upload progress, allowing removal or replacement.",
  "frontend/src/components/admin/LogoUploadCard.tsx": "Enables admins to preview and upload a new site logo with validation and progress tracking.",
  "frontend/src/components/admin/ProductForm.tsx": "Form for creating or editing a product, including fields, image upload, and submit logic for backend mutations.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper adding header, footer, and animated main content region.",
  "frontend/src/components/Auth/AccessDeniedScreen.tsx": "Displays an access-denied message with different text for authenticated and unauthenticated users and navigation options.",
  "frontend/src/components/Auth/LoginButton.tsx": "Handles Internet Identity login/logout, shows user name, and manages login status UI.",
  "frontend/src/components/Auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter their name and save a profile.",
  "frontend/src/components/Auth/ProtectedAdminRoute.tsx": "Route guard that checks identity and admin role, showing a loading spinner or access-denied screen when appropriate.",
  "frontend/src/components/cart/AddToCartButton.tsx": "Renders an add-to-cart UI with quantity selection, authentication checks, stock validation, and mutation triggers.",
  "frontend/src/components/cart/CartLineItem.tsx": "Displays a cart item with product info, quantity editing, removal controls, and live mutation updates.",
  "frontend/src/components/products/CategoryFilter.tsx": "Provides a tab-based category selector that updates the selected category.",
  "frontend/src/components/products/CategoryIconStrip.tsx": "Shows a static icon strip image representing product categories.",
  "frontend/src/components/products/ProductCard.tsx": "Displays product details in a card with image, metadata, price, and navigation to the product page.",
  "frontend/src/components/products/ProductImage.tsx": "Renders a product image or a fallback icon if no image is available.",
  "frontend/src/components/SiteFooter.tsx": "Renders a footer with company info, navigation links, and a dynamic copyright line including a caffeine.ai referral link.",
  "frontend/src/components/SiteHeader.tsx": "Displays the main site header with logo, navigation, authentication controls, cart badge, and a mobile menu; adapts links based on user role.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on authentication, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useAdminProducts.ts": "Provides create, update, and delete product mutations with backend actor and query invalidation.",
  "frontend/src/hooks/useCart.ts": "Implements cart queries and mutations including retrieval, add, update, remove, clear, and total calculation.",
  "frontend/src/hooks/useCeoPhoto.ts": "Fetches and updates the CEO photo blob from the backend.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Retrieves the authenticated user's profile using the backend actor.",
  "frontend/src/hooks/useCurrentUserRole.ts": "Fetches the current user's role from the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity login state, identity retrieval, and context exposure for authentication.",
  "frontend/src/hooks/useLogo.ts": "Fetches and updates the site's logo blob with backend actor integration.",
  "frontend/src/hooks/useOrders.ts": "Provides React Query hooks to place orders and fetch order data with error handling and cache invalidation.",
  "frontend/src/hooks/useProducts.ts": "Defines hooks to fetch all products or a single product and includes a helper to extract sorted categories.",
  "frontend/src/hooks/useQueries.ts": "Contains a mutation hook to save the caller's user profile and invalidate related cache.",
  "frontend/src/index.css": "Tailwind CSS configuration defining theme variables, dark mode, animations, and utility classes.",
  "frontend/src/lib/utils.ts": "Exports a utility function for merging class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Initializes the app by setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with CEO info, company values, and admin-only photo upload controls.",
  "frontend/src/pages/AdminOrdersPage.tsx": "Displays all customer orders with loading states and detailed order item lists for admins.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard for managing products, uploading the logo, and creating or editing products.",
  "frontend/src/pages/CartPage.tsx": "Shows the user’s cart with product details, totals, and navigation to checkout.",
  "frontend/src/pages/CatalogPage.tsx": "Displays all products with category filtering, using loading states and animated product cards.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout flow, showing cart items, calculating totals, placing orders, and showing order confirmation.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section, feature highlights, and navigation links to catalog and about pages.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Shows detailed product information with image, specs, stock status, and add-to-cart functionality.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL parameters with session persistence and hash support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and included plugins.",
  "project_state.json": "Contains project metadata, architectural notes, known issues, and a list of existing features for the FS Enterprises marketing website/app. Highlights admin restrictions, asset management rules, and a checkout bug needing fixes."
}