{
  "kind": "build_request",
  "title": "Fix “User not registered” error during checkout/order placement",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-20",
      "text": "Prevent unauthenticated users from attempting to place an order: on the Checkout page, if the user is not signed in with Internet Identity, block order placement and show a clear English message prompting the user to log in before placing an order.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "WHILE PLACEING ORDER USER NOT REGSISER IS COMING?"
        ]
      },
      "acceptanceCriteria": [
        "When not logged in, the Checkout page does not call the backend placeOrder method.",
        "Clicking “Place Order” while logged out shows an English error message (e.g., “Please log in to place an order.”).",
        "The UI remains stable (no console-only failures) when a logged-out user visits /checkout directly."
      ]
    },
    {
      "id": "REQ-21",
      "text": "Fix backend authorization so authenticated customers can place orders without seeing “user not registered”/authorization errors: ensure any authenticated (non-anonymous) caller is treated as a valid “user” for user-scoped methods used by checkout (getCart, calculateCartTotal, placeOrder, and related cart/order queries) while keeping admin-only protections unchanged.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "WHILE PLACEING ORDER USER NOT REGSISER IS COMING?"
        ]
      },
      "acceptanceCriteria": [
        "An authenticated non-admin user can successfully call getCart, calculateCartTotal, and placeOrder without receiving an authorization/registration error.",
        "An unauthenticated (anonymous) caller is still rejected for user-scoped cart/order methods with a clear English error message.",
        "Admin-only methods (e.g., getAllOrders, product CRUD, updateLogo, updateCeoPhoto) remain admin-gated and do not become accessible to normal users."
      ]
    },
    {
      "id": "REQ-22",
      "text": "Improve order placement error UX: when placeOrder fails due to authorization/identity issues, display a friendly English toast message that explains the required action (log in / try again) instead of surfacing confusing “user not registered” wording.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "WHILE PLACEING ORDER USER NOT REGSISER IS COMING?"
        ]
      },
      "acceptanceCriteria": [
        "If placeOrder fails due to missing authentication/permissions, the toast message is in English and instructive (no “user not registered” phrasing).",
        "If placeOrder fails for other reasons (e.g., cart empty), the user sees an appropriate English error message."
      ]
    }
  ],
  "constraints": [
    "Backend must remain single-actor; keep all Motoko logic in backend/main.mo.",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui."
  ],
  "nonGoals": [
    "Adding new checkout fields (address, phone, payment integration).",
    "Introducing third-party auth providers beyond Internet Identity.",
    "Adding real-time order updates/notifications."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}