{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Checkout auth guard + friendly order placement errors",
  "requirements": [
    {
      "id": "REQ-20",
      "summary": "Block order placement on Checkout when not authenticated with Internet Identity, and prompt user to log in.",
      "acceptanceCriteria": [
        "When not logged in, the Checkout page does not call the backend placeOrder method.",
        "Clicking “Place Order” while logged out shows an English error message (e.g., “Please log in to place an order.”).",
        "The UI remains stable (no console-only failures) when a logged-out user visits /checkout directly."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CheckoutPage.tsx",
          "operation": "modify",
          "description": "Add an Internet Identity authentication guard on the Checkout page: detect logged-out state via useInternetIdentity, prevent calling usePlaceOrder().mutateAsync when unauthenticated, disable or gate the “Place Order” button, and show a clear English message prompting login (inline and/or toast). Ensure direct navigation to /checkout while logged out renders a stable view (no crashes/uncaught errors). Use the authorization component’s frontend auth guidance for determining authenticated vs guest behavior; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/CheckoutPage.tsx",
          "operation": "modify",
          "description": "Adjust order placement handler to avoid console-only failure UX: rely on user-facing messaging for auth failures and keep error handling graceful (no leaking confusing backend wording). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-22",
      "summary": "Show friendly English toasts for placeOrder authorization/identity failures, avoiding “user not registered” wording.",
      "acceptanceCriteria": [
        "If placeOrder fails due to missing authentication/permissions, the toast message is in English and instructive (no “user not registered” phrasing).",
        "If placeOrder fails for other reasons (e.g., cart empty), the user sees an appropriate English error message."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useOrders.ts",
          "operation": "modify",
          "description": "Improve placeOrder error handling: detect authorization/identity-related failures (e.g., anonymous/unauthorized, or messages containing “user not registered”) and map them to a friendly English toast such as “Please log in to place an order.” For non-auth failures, map to an appropriate English message (e.g., empty cart). Keep existing success invalidations/toasts. Use the authorization component’s error-handling guidance to treat backend traps gracefully; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}